cnlohr/ch32fun/extralibs/iSLER.h
/* 
	iSLER header for the CH570, 571, 572, 573, 582, 583, 584, 585, 591, 592

	For basic RF functionality on supported WCH chips.

		#define ACCESS_ADDRESS 0x8E89BED6 // the "BED6" address for BLE advertisements

		// Initialize the iSLER engine, with the TX power.
		iSLERInit(LL_TX_POWER_0_DBM);

		// TX packets
		iSLERTX(ACCESS_ADDRESS, txbuf, sizeof(txbuf), adv_channels[c], PHY_1M);

	To receive packets, you can either:

		#define ISLER_CALLBACK_RX iSLERRXCallback
		#define ISLER_CALLBACK_TX iSLERTXCallback

		void iSLERRXCallback()
		{
			if( !iSLERCRCOK() ) return;

			uint8_t *frame = (uint8_t*)LLE_BUF;
			int rssi = iSLERRSSI();

			// Do stuff
		}

		void iSLERTXCallback()
		{
			// TX is done, continue using the radio
		}

	Or, just poll on rx_ready, whenever it's set you can read the packet.

		iSLERRX(ACCESS_ADDRESS, 37, PHY_1M);
		while(!rx_ready);
		// Receive packet code.

*/

// 2025-12-25 function rename.
#define RFCoreInit iSLERInit
#define Frame_TX   iSLERTX
#define Frame_RX   iSLERRX
#define ReadRSSI   iSLERRSSI

#ifdef ISLER_CALLBACK
#warning "ISLER_CALLBACK is deprecated, use ISLER_CALLBACK_RX"
#define ISLER_CALLBACK_RX ISLER_CALLBACK
#endif

#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <string.h>

// define the linker section where the "highcode" functions live
// on ch5xx this is a section of RAM for quicker execution,
// but for example in funcongif.h
//  #define FUNCONF_ISLER_SECTION __attribute__( ( section( ".manual_ram" ) ) )
// you can put it where you want
#if defined(FUNCONF_ISLER_SECTION)
#ifdef __HIGH_CODE
#undef __HIGH_CODE
#endif
#define __HIGH_CODE FUNCONF_ISLER_SECTION
#elif !defined(__HIGH_CODE)
#define __HIGH_CODE
#endif

#ifndef __INTERRUPT // for v208
#define __INTERRUPT __attribute__((interrupt))
#endif

#define LL_RX              0x01
#define LL_TX              0x02
#define LL_STOP            0x08
#define LL_AUTO            0x01

// common fields
#define CTRL_CFG           BB0
#define CRCINIT1           BB1
#define STATUS             LL2
#define INT_EN             LL3
#define CTRL_MOD           LL20
#define TXTUNE_CTRL        RF14
#define TXCTUNE_CO_CTRL    RF36
#define TXCTUNE_GA_CTRL    RF37
#define RXTUNE             RF39
#define TXCTUNE_CO         RF40
#define TXCTUNE_GA         RF50

// chip specific fields
#ifdef CH570_CH572
#define CRCPOLY1           BB2
#define ACCESSADDRESS1     BB3
#define CTRL_TX            BB13
#define CRCINIT2           BB22
#define CRCPOLY2           BB23
#define ACCESSADDRESS2     BB24
#define TMR0               LL25 // 5 count down timers, at 2MHz.
#define INT_ISLER_TMR0     (1 << 17)
#define TMR1               LL26
#define INT_ISLER_TMR1     (1 << 18)
#define TMR2               LL27
#define INT_ISLER_TMR2     (1 << 19)
#define TMR3               LL28
#define INT_ISLER_TMR3     (1 << 20)
#define TMR4               LL29
#define INT_ISLER_TMR4     (1 << 21)
#define TXBUF              LL30
#define RXBUF              LL31
#define CTRL_MOD_RFSTOP    0xfffff8ff
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffcffff) | 0x20000)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffcffff) | 0x10000)
#define DEVSETMODE_TUNE    0x0558
#define DEVSETMODE_TX      0x0258
#define DEVSETMODE_RX      0x0158
#define CTRL_CFG_PHY_1M    ((BB->CTRL_CFG & 0xfffffcff) | 0x100)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG & 0xfffffcff)
#define LL_STATUS_TX       0x20000
#define CTRL_CFG_START_TX  0x1000000
#elif defined(CH571_CH573)
#define TXBUF 		       DMA4
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define RSSI               BB12 // ? couldn't find it, not sure
#define TMR0               LL24
#define INT_ISLER_TMR0     (1 << 14)
#define TMR1               LL25
#define INT_ISLER_TMR1     (1 << 15)
#define RXBUF              LL29
#define RFEND_TXCTUNE_INIT 0x180000
#define CTRL_MOD_RFSTOP    0xfffffff8
#define DEVSETMODE_TUNE    0x5d
#define DEVSETMODE_TX      0x5a
#define DEVSETMODE_RX      0x59
#define CTRL_CFG_PHY_1M    (BB->CTRL_CFG | 0x10000000)
#define LL_STATUS_TX       0x20000
#define CTRL_CFG_START_TX  (BB->CTRL_CFG & 0xefffffff)
#elif defined(CH582_CH583)
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define RSSI               BB12
#define TMR0               LL25 // 3 count down timers, at 2MHz.
#define INT_ISLER_TMR0     (1 << 13)
#define TMR1               LL26
#define INT_ISLER_TMR1     (1 << 14)
#define TMR2               LL27
#define INT_ISLER_TMR2     (1 << 15)
#define TXBUF              LL28
#define RXBUF              LL29
#define RFEND_TXCTUNE_INIT 0x880000
#define CTRL_TX_TXPOWER    0x80010e78
#define CTRL_MOD_RFSTOP    0xfffffff8
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffffe7f) | 0x100)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffffe7f) | 0x80)
#define DEVSETMODE_TUNE    0x00dd
#define DEVSETMODE_TX      0x00da
#define DEVSETMODE_RX      0x00d9
#define CTRL_CFG_PHY_1M    ((BB->CTRL_CFG & 0xffff0fff) | 0x1000)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG & 0xffff0fff)
#define CTRL_CFG_PHY_CODED ((BB->CTRL_CFG & 0xffff0fff) | 0x2000)
#define LL_STATUS_TX       0x2000
#define CTRL_CFG_START_TX  0x800000
#elif (defined(CH584_CH585) || defined(CH591_CH592))
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define RSSI               BB12
#define TMR0               LL25
#define INT_ISLER_TMR0     (1 << 17)
#define TMR1               LL26
#define INT_ISLER_TMR1     (1 << 18)
#define TMR2               LL27
#define INT_ISLER_TMR2     (1 << 19)
#define TMR3               LL28
#define INT_ISLER_TMR3     (1 << 20)
#define TMR4               LL29
#define INT_ISLER_TMR4     (1 << 21)
#define TXBUF              LL30
#define RXBUF              LL31
#define CTRL_MOD_RFSTOP    0xfffff8ff
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffffcff) | 0x280)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffffcff) | 0x100)
#define DEVSETMODE_TUNE    0x0558
#define DEVSETMODE_TX      0x0258
#define DEVSETMODE_RX      0x0158
#define CTRL_CFG_PHY_1M    (BB->CTRL_CFG & 0xffffff7f)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG | 0x80)
#define LL_STATUS_TX       0x20000
#define CTRL_CFG_START_TX  0x800000
#elif defined(CH32V20x)
#define CH32V208
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define RSSI               BB12
#define TMR0               LL25 // 3 count down timers, at 2MHz.
#define INT_ISLER_TMR0     (1 << 13)
#define TMR1               LL26
#define INT_ISLER_TMR1     (1 << 14)
#define TMR2               LL27
#define INT_ISLER_TMR2     (1 << 15)
#define TXBUF              LL28
#define RXBUF              LL29
#define RFEND_TXCTUNE_INIT 0x100000
#define CTRL_TX_TXPOWER    0x80010ec8
#define CTRL_MOD_RFSTOP    0xfffffff8
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffffe7f) | 0x100)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffffe7f) | 0x80)
#define DEVSETMODE_TUNE    0x5d
#define DEVSETMODE_TX      0x5a
#define DEVSETMODE_RX      0x59
#define CTRL_CFG_PHY_1M    ((BB->CTRL_CFG & 0xffff0fff) | 0x1000)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG & 0xffff0fff)
#define CTRL_CFG_PHY_CODED ((BB->CTRL_CFG & 0xffff0fff) | 0x2000)
#define LL_STATUS_TX       0x2000
#define CTRL_CFG_START_TX  0x800000
#else
#error "MCU_TARGET selected in Makefile is not supported"
#endif

#ifdef CH32V208
#define BB_BASE  (0x40024100) // Baseband, digital part of the PHY
#define LL_BASE  (0x40024200) // Link Layer, MAC
#define RF_BASE  (0x40025000) // Radio frontend, analog part of the PHY
#else
#define DMA_BASE (0x4000c000)
#define BB_BASE  (0x4000c100)
#define LL_BASE  (0x4000c200)
#define RF_BASE  (0x4000d000)
#endif

