cnlohr/ch32fun/extralibs/iSLER.h
	LL->TMR0 = 100;
	while(LL->TMR0 && ((RF->RXTUNE >> 8) & 1));

	tuneFilter = RF->RXTUNE & 0x1f;
	RF->RF20 |= 0x10000;
	RF->RF20 = (RF->RF20 & 0xffffffe0) | tuneFilter;
	RF->RF2 &= 0xffdfffff;
	tuneFilter2M = (tuneFilter +2 < 0x1f) ? (tuneFilter +2) : 0x1f;

	// RXADC
	RF->RF22 &= 0xfffeffff;
	RF->RF2 |= 0x10000;
	RF->RF3 = (RF->RF3 & 0xfffffeff) | 0x100;
	RF->RF1 = (RF->RF1 & 0xfffeffff) | 0x100000;
}

void RegInit() {
	DevSetMode(DEVSETMODE_TUNE);
	RFEND_TXTune();
	RFEND_RXTune();
	DevSetMode(0);
}

void DevSetChannel(uint8_t channel) {
#ifdef CH571_CH573
	BB->BB6 = (BB->BB6 & 0xf8ffffff) | 0x4000000;
	BB->BB6 = (BB->BB6 & 0xffffff83) | 0x1c;
#endif
	RF->RF11 &= 0xfffffffd;
	BB->CTRL_CFG = (BB->CTRL_CFG & 0xffffff80) | (channel & 0x7f);
}

void iSLERInit(uint8_t TxPower) {
#if defined(CH571_CH573) || defined(CH584_CH585) // maybe all?
	NVIC->IENR[0] = 0x1000;
	NVIC->IRER[0] = 0x1000;
#endif
	DevInit(TxPower);
	RegInit();
	NVIC->IPRIOR[0x15] |= 0x80;
	NVIC_EnableIRQ(LLE_IRQn);
}

__HIGH_CODE
void iSLERStop() {
	DevSetMode(0);
	if(LL->LL0 & (LL_RX | LL_TX)) {
		LL->CTRL_MOD &= CTRL_MOD_RFSTOP;
		LL->LL0 |= LL_STOP;
	}
}

__HIGH_CODE
int iSLERRSSI() {
#ifdef CH570_CH572
	uint8_t *tx_buf = (uint8_t*)LLE_BUF;
	int len = tx_buf[1];
	return (int8_t)tx_buf[len +4];
#else
	return (int8_t)(BB->RSSI >> 0xf);
#endif
}

__HIGH_CODE
int iSLERCRCOK() {
#ifdef CH570_CH572
	uint8_t *tx_buf = (uint8_t*)LLE_BUF;
	int len = tx_buf[1];
	return (int8_t)!(tx_buf[len + 5] & 0x10);
#else
	// Unimplemented!
	return -1;
#endif
}

__HIGH_CODE
void iSLERLinkConfig(uint32_t access_address, uint8_t channel, uint8_t phy_mode, uint8_t *txbuf, uint8_t auto_mode) {
	// Set channel and tx buffer
	gs_iSLERLink.access_address = access_address;
	gs_iSLERLink.channel = channel;
	gs_iSLERLink.txbuf = (uint32_t)txbuf;
	gs_iSLERLink.phy_mode = phy_mode;

	DevSetChannel(channel);

	if (txbuf != NULL) {
#if defined(CH571_CH573)
		DMA->TXBUF = (uint32_t)txbuf;
#else
		LL->TXBUF = (uint32_t)txbuf;
#endif
	}

	// Set Access Address & CRC
	BB->ACCESSADDRESS1 = access_address;
	BB->CRCINIT1 = 0x555555;
#ifdef CH570_CH572
	BB->ACCESSADDRESS2 = access_address;
	BB->CRCINIT2 = 0x555555;
	BB->CRCPOLY1 = (BB->CRCPOLY1 & 0xff000000) | 0x80032d;
	BB->CRCPOLY2 = (BB->CRCPOLY2 & 0xff000000) | 0x80032d;
#endif

	// Set Global PHY Mode (CTRL_CFG)
#if defined(CH582_CH583) || defined(CH32V208)
	BB->CTRL_CFG = (phy_mode == PHY_2M) ? CTRL_CFG_PHY_2M:
				   (phy_mode == PHY_S2) ? CTRL_CFG_PHY_CODED:
				   (phy_mode == PHY_S8) ? CTRL_CFG_PHY_CODED:
										  CTRL_CFG_PHY_1M; 
	if(phy_mode > PHY_2M) { // coded phy
		BB->CTRL_CFG = (BB->CTRL_CFG & 0xffff3fff) | ((phy_mode == PHY_S2) ? 0x4000 : 0);
	}
#elif defined(CH571_CH573)
	BB->CTRL_CFG = CTRL_CFG_PHY_1M; // no 2M PHY on ch571/3
#else
	BB->CTRL_CFG = (phy_mode == PHY_2M) ? CTRL_CFG_PHY_2M:
										  CTRL_CFG_PHY_1M; 
#endif

	// Baseband Tuning
#ifdef CH570_CH572
	BB->BB9 &= (phy_mode == PHY_2M) ? 0xf9ffffff : 0xfbffffff;
	RF->RF20 = (RF->RF20 & 0xffffffe0) | ((phy_mode == PHY_2M) ? (tuneFilter2M & 0x1f) : (tuneFilter & 0x1f));
	BB->BB5 = (BB->BB5 & 0xffffffc0) | ((phy_mode == PHY_2M) ? 0xd : 0xb);
	BB->BB7 = (BB->BB7 & 0xff00fc00) | ((phy_mode == PHY_2M) ? 0x7f00a0 : 0x79009c);
#elif defined(CH582_CH583) || defined(CH32V208)
#if defined(CH582_CH583)
	BB->BB4 = (phy_mode < PHY_S2) ? 0x3722d0 : 0x3722df;
#elif defined(CH32V208)
	BB->BB4 = (phy_mode < PHY_S2) ? 0x3222d0 : 0x34a4df;
#endif
	BB->BB5 = (phy_mode < PHY_S2) ? 0x8101901 : 0x8301ff1;
	BB->BB6 = (phy_mode < PHY_S2) ? 0x31624 : 0x31619;
	BB->BB8 = (phy_mode < PHY_S2) ? 0x90083 : 0x90086;
	BB->BB9 = 0x1006310;
	BB->BB10 = (phy_mode < PHY_S2) ? 0x28be : 0x28de;
#elif defined(CH584_CH585) || defined(CH591_CH592)
	BB->BB6 = (BB->BB6 & 0xfffffc00) | ((phy_mode == PHY_2M) ? 0x13a : 0x132);
	BB->BB4 = (BB->BB4 & 0x00ffffff) | ((phy_mode == PHY_2M) ? 0x78000000 : 0x7f000000);
#endif

	if(auto_mode) {
		// switch between RX <-> TX automatically
		LL->LL1 |= LL_AUTO;
	}
	else {
		LL->LL1 &= ~LL_AUTO;
	}

	gs_iSLERLink.is_open = 1;
}

__HIGH_CODE
void iSLERLinkTX() {
	iSLERStop();
	DevSetMode(DEVSETMODE_TX);

	// Wait for PLL tuning bit to clear (ensures radio has settled after mode switch)
	// TODO: RF26 0x1000000 is for CH570/2, figure out this bit on the others
	for( int timeout = Ticks_from_Us(100); !(RF->RF26 & 0x1000000) && timeout >= 0; timeout-- );

#if defined(CH584_CH585) || defined(CH591_CH592)
	BB->CTRL_CFG = (gs_iSLERLink.phy_mode == PHY_2M) ? CTRL_CFG_PHY_2M: CTRL_CFG_PHY_1M;
#endif

	tx_done = 0;
	BB->CTRL_CFG |= CTRL_CFG_START_TX;
	BB->CTRL_TX &= ~((1 << 0) | (1 << 1)); // TX specific: Clear bits 0-1
	LL->LL0 = LL_TX;
}

__HIGH_CODE
void iSLERLinkRX(void) {
	iSLERStop();
	DevSetMode(DEVSETMODE_RX);

#ifdef CH571_CH573
	BB->CTRL_TX |= (1 << 1); // RX specific: Set bit 1
#elif defined(CH584_CH585) || defined(CH591_CH592)
	BB->CTRL_CFG = (gs_iSLERLink.phy_mode == PHY_2M) ? CTRL_CFG_PHY_2M: CTRL_CFG_PHY_1M;
#endif

	LL->LL0 = LL_RX;
#ifndef ISLER_CALLBACK_RX
	rx_ready = 0;
#endif
}

__HIGH_CODE
void iSLERTX(uint32_t access_address, uint8_t txbuf[], size_t len, uint8_t channel, uint8_t phy_mode) {
	txbuf[1] = (len > 257) ? 255 : len -2;
	iSLERLinkConfig(access_address, channel, phy_mode, txbuf, /*auto_mode*/0);
	iSLERLinkTX();

	// make it blocking using Idle, for more control over things use iSLERLink[Config,RX,TX]
#ifdef ISLER_IDLE_WHILE_TX
	while(!tx_done) {
		NVIC->SCTLR &= ~(1 << 2); // don't deep sleep
		NVIC->SCTLR &= ~(1 << 3); // wfi
		__WFI();
	}
#else
	for( int timeout = Ticks_from_Ms(5); !tx_done && timeout >= 0; timeout-- );
#endif
	gs_iSLERLink.is_open = 0;
}

__HIGH_CODE
void iSLERRX(uint32_t access_address, uint8_t channel, uint8_t phy_mode) {
	iSLERLinkConfig(access_address, channel, phy_mode, NULL, /*auto_mode*/0);
	iSLERLinkRX();
	gs_iSLERLink.is_open = 0;
}
